### Exercise 17.1 (Books Database) In an IPython session, perform each of the following tasks on the books database from Section 17.2:

In [1]:
import sqlite3
connection = sqlite3.connect('books.db')
import pandas as pd

### a) Select all authorsâ€™ last names from the authors table in descending order.

In [2]:
pd.read_sql('SELECT last FROM authors ORDER BY last DESC', connection)

     last
0    Wald
1   Quirk
2  Deitel
3  Deitel
4  Deitel

### b) Select all book titles from the titles table in ascending order.

In [3]:
pd.read_sql('SELECT title FROM titles ORDER BY title ASC', connection)

                              title
0         Android 6 for Programmers
1            Android How to Program
2                  C How to Program
3                C++ How to Program
4     Internet & WWW How to Program
5     Intro to Python for CS and DS
6               Java How to Program
7  Visual Basic 2012 How to Program
8          Visual C# How to Program
9         Visual C++ How to Program

### c) Use an INNER JOIN to select all the books for a specific author. Include the title, copyright year and ISBN. Order the information alphabetically by title.

In [4]:
pd.read_sql("""SELECT titles.title, titles.copyright, titles.isbn 
    FROM ((authors INNER JOIN author_ISBN ON authors.id = author_ISBN.id) 
    INNER JOIN titles ON author_ISBN.isbn = titles.isbn) 
    WHERE authors.last LIKE 'Deitel' AND authors.first LIKE 'Harvey'
    ORDER BY titles.title ASC""", connection)

                              title copyright        isbn
0         Android 6 for Programmers      2016  0134289366
1            Android How to Program      2017  0134444302
2                  C How to Program      2016  0133976890
3                C++ How to Program      2017  0134448235
4     Internet & WWW How to Program      2012  0132151006
5     Intro to Python for CS and DS      2020  0135404673
6               Java How to Program      2018  0134743350
7  Visual Basic 2012 How to Program      2014  0133406954
8          Visual C# How to Program      2017  0134601548
9         Visual C++ How to Program      2008  0136151574

### d) Insert a new author into the authors table.

In [5]:
cursor = connection.cursor()
cursor = cursor.execute("""INSERT INTO authors (first, last) 
    VALUES ('John', 'Shovic')""")
cursor.rowcount

1

In [6]:
pd.read_sql('SELECT * FROM authors', connection, index_col=['id'])

        first    last
id
1        Paul  Deitel
2      Harvey  Deitel
3       Abbey  Deitel
4         Dan   Quirk
5   Alexander    Wald
6        John  Shovic

### e) Insert a new title for an author. Remember that the book must have an entry in the author_ISBN table and an entry in the titles table.

In [7]:
cursor = cursor.execute("""INSERT INTO author_ISBN (id, isbn) 
    VALUES ('6', '1394236158')""")
cursor.rowcount

1

In [8]:
cursor = cursor.execute("""INSERT INTO titles (title, isbn, edition, copyright) 
    VALUES ('Python All-in-One For Dummies', '1394236158','3','2024')""")
cursor.rowcount

1

In [9]:
pd.read_sql("""SELECT * FROM author_ISBN WHERE isbn='1394236158' """, connection)

   id        isbn
0   6  1394236158

In [10]:
pd.read_sql("""SELECT * FROM titles WHERE isbn='1394236158'""", connection)

         isbn                          title  edition copyright
0  1394236158  Python All-in-One For Dummies        3      2024

In [11]:
pd.read_sql("""SELECT authors.first, authors.last, titles.title, titles.copyright, titles.isbn 
    FROM ((authors INNER JOIN author_ISBN ON authors.id = author_ISBN.id) 
    INNER JOIN titles ON author_ISBN.isbn = titles.isbn) 
    WHERE authors.last LIKE 'Shovic' AND authors.first LIKE 'John'
    ORDER BY titles.title ASC""", connection)

  first    last                          title copyright        isbn
0  John  Shovic  Python All-in-One For Dummies      2024  1394236158

In [12]:
connection.close()